augmented_list = ['마늘', '명란젓', '문어', '배추', '배추김치', '버섯', '생크림', '소면', '연근', '와플', '치커리', '파슬리' ,'팽이버섯']

print(len(augmented_list))

label_dict = {'가리비': 0, '가지': 1, '게맛살': 2, '고구마': 3, '고등어': 4, '고추': 5, '고추장': 6, '그린올리브': 7, '김': 8, 
            '꼬막': 9, '녹색피망': 10, '느타리버섯': 11, '다시마': 12, '단호박': 13, '달걀': 14, '당근': 15, '대파': 16, 
            '두부': 17, '땅콩버터': 18, '랍스타': 19, '레몬': 20, '로메인상추': 21, '리코타치즈': 22, '마늘': 23, '마요네즈': 24, 
            '만두': 25, '명란젓': 26, '모짜렐라치즈': 27, '무우': 28, '문어': 29, '물미역': 30, '바게트': 31, '밥': 32, 
            '방울토마토': 33, '배추': 34, '배추김치': 35, '버섯': 36, '버터': 37, '베이글': 38, '브로콜리': 39, '삶은달걀': 40, 
            '새우': 41, '샐러리': 42, '생크림': 43, '소면': 44, '스파게티면': 45, '양배추': 46, '연근': 47, '와플': 48, '우유': 49, 
            '잡곡식빵': 50, '적양배추': 51, '전복': 52, '체다치즈': 53, '치커리': 54, '칠리소스': 55, '케일': 56, '케첩': 57, 
            '토마토': 58, '토마토파스타소스': 59, '파슬리': 60, '파인애플': 61, '파프리카': 62, '팽이버섯': 63, '표고버섯': 64,
            '숙주나물': 65, '슬라이스치즈': 66, '시금치': 67, '아보카도': 68, '애호박': 69, '양파':70, '오이':71, '오징어':72,
            '아몬드':73, '사과':74, '블루베리': 75, '호두': 76}

print(len(label_dict))